---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalCurveSelector
source: html/52eafef1-198c-a2d8-ebc3-615e96b6fbbb.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalCurveSelector

Specifies which portion of an Analytical Curve is of interest.

## Syntax (C#)
```csharp
public enum AnalyticalCurveSelector
```